balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F66K80.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3D0" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B3D0" edc:desc="" edc:mask="0xff" edc:name="B3D0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B3D00" edc:desc="" edc:mask="0x1" edc:name="B3D00" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D01" edc:desc="" edc:mask="0x1" edc:name="B3D01" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D02" edc:desc="" edc:mask="0x1" edc:name="B3D02" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D03" edc:desc="" edc:mask="0x1" edc:name="B3D03" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D04" edc:desc="" edc:mask="0x1" edc:name="B3D04" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D05" edc:desc="" edc:mask="0x1" edc:name="B3D05" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D06" edc:desc="" edc:mask="0x1" edc:name="B3D06" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D07" edc:desc="" edc:mask="0x1" edc:name="B3D07" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3D1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B3D1" edc:desc="" edc:mask="0xff" edc:name="B3D1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B3D10" edc:desc="" edc:mask="0x1" edc:name="B3D10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D11" edc:desc="" edc:mask="0x1" edc:name="B3D11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D12" edc:desc="" edc:mask="0x1" edc:name="B3D12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D13" edc:desc="" edc:mask="0x1" edc:name="B3D13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D14" edc:desc="" edc:mask="0x1" edc:name="B3D14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D15" edc:desc="" edc:mask="0x1" edc:name="B3D15" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D16" edc:desc="" edc:mask="0x1" edc:name="B3D16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D17" edc:desc="" edc:mask="0x1" edc:name="B3D17" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3D2" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B3D2" edc:desc="" edc:mask="0xff" edc:name="B3D2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B3D20" edc:desc="" edc:mask="0x1" edc:name="B3D20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D21" edc:desc="" edc:mask="0x1" edc:name="B3D21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D22" edc:desc="" edc:mask="0x1" edc:name="B3D22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D23" edc:desc="" edc:mask="0x1" edc:name="B3D23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D24" edc:desc="" edc:mask="0x1" edc:name="B3D24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D25" edc:desc="" edc:mask="0x1" edc:name="B3D25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D26" edc:desc="" edc:mask="0x1" edc:name="B3D26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D27" edc:desc="" edc:mask="0x1" edc:name="B3D27" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3D3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B3D3" edc:desc="" edc:mask="0xff" edc:name="B3D3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B3D30" edc:desc="" edc:mask="0x1" edc:name="B3D30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D31" edc:desc="" edc:mask="0x1" edc:name="B3D31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D32" edc:desc="" edc:mask="0x1" edc:name="B3D32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D33" edc:desc="" edc:mask="0x1" edc:name="B3D33" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D34" edc:desc="" edc:mask="0x1" edc:name="B3D34" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D35" edc:desc="" edc:mask="0x1" edc:name="B3D35" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D36" edc:desc="" edc:mask="0x1" edc:name="B3D36" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D37" edc:desc="" edc:mask="0x1" edc:name="B3D37" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3D4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B3D4" edc:desc="" edc:mask="0xff" edc:name="B3D4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B3D40" edc:desc="" edc:mask="0x1" edc:name="B3D40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D41" edc:desc="" edc:mask="0x1" edc:name="B3D41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D42" edc:desc="" edc:mask="0x1" edc:name="B3D42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D43" edc:desc="" edc:mask="0x1" edc:name="B3D43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D44" edc:desc="" edc:mask="0x1" edc:name="B3D44" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D45" edc:desc="" edc:mask="0x1" edc:name="B3D45" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D46" edc:desc="" edc:mask="0x1" edc:name="B3D46" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D47" edc:desc="" edc:mask="0x1" edc:name="B3D47" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3D5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B3D5" edc:desc="" edc:mask="0xff" edc:name="B3D5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B3D50" edc:desc="" edc:mask="0x1" edc:name="B3D50" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D51" edc:desc="" edc:mask="0x1" edc:name="B3D51" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D52" edc:desc="" edc:mask="0x1" edc:name="B3D52" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D53" edc:desc="" edc:mask="0x1" edc:name="B3D53" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D54" edc:desc="" edc:mask="0x1" edc:name="B3D54" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D55" edc:desc="" edc:mask="0x1" edc:name="B3D55" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D56" edc:desc="" edc:mask="0x1" edc:name="B3D56" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3D57" edc:desc="" edc:mask="0x1" edc:name="B3D57" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
